// ============================= MAIN CONFIG FILE =============================
// It's possible to change values directly in this file, but by creating a file
// called "config.override.json5" in the same directory you can override values
// without making changes here. This makes your config a lot more portable.

{
	"_version": "0.2.1",

	// Sends information about the grenades thrown this round to a server
	// This information in only used to train a model to predict grenade
	// landings, no personal information is send or logged.
	// https://github.com/boltgolt/boltobserv/wiki/FAQ:-Automatically-collecting-grenade-data-from-Boltobserv
	"nadeCollection": true,

	// Settings related to the Boltobserv window
	"window": {
		// Don't show radar in a window, only a small status window will open
		"disable": false,

		// Always show the window as the top application
		"alwaysOnTop": false,

		// Make the background of the window transparent
		"transparent": false,

		// Start window as a full screen application
		// Use ALT + F4 to quit
		"fullscreen": false,

		// Will disable GPU rendering, helps capture the window in programs like OBS
		"disableGpu": false,

		// Do not capture mouse events, allowing interaction with the window underneath
		// Dragging or resizing the window will be disabled if this option is true
		"mousePassthrough": false,

		// The default shape and position of the window
		"defaultSize": {
			// The height and width in pixels
			"height": 600,
			"width": 600,

			// The default distance from the top left of the screen
			// Set to -1 to let the OS pick the best place
			"top": -1,
			"left": -1
		}
	},

	// Settings related to remote browser access to the radar
	"browser": {
		// Prevents a background from being set in the browser, for OBS capture
		"transparent": false,

		"ports": {
			// Serves static files, such as HTML. Use this one in your browser
			"static": 36364,
			// Dynamic websocket port, used for live data transport
			"socket": 36365
		}
	},

	// Settings that will change the way the radar will be displayed
	"radar": {
		// Hide advisories on the radar
		"hideAdvisories": false,

		// Frames to smooth out player movement
		"playerSmoothing": 13,

		// Amount of scaling to apply to player dots on the radar
		// Values above 1 might be blurry
		"playerDotScale": 0.7,
		// Same as the above, but for the bomb
		"bombDotScale": 0.7
	},

	// Settings related to the CSGO game
	"game": {
		// Seconds of inactivity before considering a connection to the game client as lost
		// Set to -1 to never timeout
		"connectionTimout": 30,

		// The port GSI will try to connect to
		"networkPort": 36363,

		// Tries to detect the CSGO game on the machine and prompts to install the CFG file if it hasn't already
		"installCfg": true
	},

	// Settings for automatically zooming in on alive players on the map
	"autozoom": {
		// Enable or disable autozoom
		"enable": false,

		// Frames to smooth out zoom movement
		"smoothing": 32,

		// Percentage of radar space to try to keep as padding between the outermost players and the edge of the radar
		"padding": 0.3,

		// Only apply autozoom if calculated zoom level would be at least this much
		// In decimals, where 1.2 would mean 20% more zoomed in than the default radar
		"minZoom": 1.3
	},

	// Settings that should not be used in normal operation, but help to find issues
	"debug": {
		// Print the loaded config into the console
		"printConfig": false,

		// Don't open any electron window, just start the server
		// Do NOT execute Boltobserv outside a terminal with this enabled, could become a zombie process
		"terminalOnly": false
	}
}
